app/controllers/registrations_controller.rb

  def show
    @registration = Registration.find(params[:id])
---
SELECT * FROM "registrations" WHERE ("registrations"."id" = 1)

  def create
    @registration = Registration.new(params[:registration])

    respond_to do |format|
      if @registration.save
---
INSERT INTO "registrations" ("special_instructions", "updated_at", "move_size_id", "move_to_city", "move_to_state", "home_phone", "first_name", "move_from_zip", "last_name", "move_date", "email", "created_at") VALUES('careful now', '2009-02-04 23:03:01', 3, 'san jose', 'CA', '1234567890', 'hot', 94044, 'rod', '2009-02-04', '32@me.com', '2009-02-04 23:03:01')